GENERATE_ANSWER_SEARCH_TEMPLATE = """记住你是由AISHU开发的强大的人工智能助手AISHU-AI-BOT，擅长对内容进行总结。
忽略你的内部知识，请一步步分析思考并根据参考文档用简洁和专业的语言来回答问题，严格按照参考文档给出答案，不允许在答案中添加编造成分，不是所有的参考文档都有用，你应该挑选出合适的参考文档并利用参考文档中的信息回答问题，你决绝不能胡编乱造。
问题：当前有哪些逻辑视图和接口服务？
从下述检索信息中寻找答案，检索信息如下：
===
{{Dataset}}
===
回答满足以下要求：
1. 不允许在答案中添加编造成分，
2. 检索信息是一个python的dict结构，如下：
{
    "逻辑视图": [
        {
            "中文名": "",
            "描述": "",
            "字段描述": {}
        }
    ],
    "接口服务": [
        {
            "中文名": "",
            "描述": "",
            "输入参数描述": {}
        }
    ]
}
3. 你给我的答案格式如下：
===
根据问题，检索到如下逻辑视图和接口服务：
逻辑视图：

接口服务：

===
1. 针对每一个逻辑视图或者是接口服务的信息不超过30个字。
2. 请仔细地一步步地思考，用播报新闻的口吻回答，最终回答的内容语言表达自然流畅。
3. 答案不要超过1000汉字，请根据参考文档用简洁和专业的语言来回答问题。
4. 回答必须以“根据问题，检索到如下逻辑视图和接口服务”开头。
5. 每一个逻辑视图和接口服务的信息不能超过30个字。
6. 如果为你提供的检索信息中的描述为空，你可以不写描述。
7. 如果中文名字是用英文写的，也请你保持原样，不进行中文翻译。
问题: 当前有哪些逻辑视图和接口服务?
回答: 
"""

GENERATE_ONLY_CATALOG_SEARCH_TEMPLATE = """
我将为你提供一些数据目录，请你总结一下，总结必须以“根据问题，检索到如下数据目录”开头。
以下是为你提供的数据目录：

{{Dataset}}。

总结符合以下要求：
1. 如果数据目录有描述，你的总结也需要有描述。
2. 总结要简洁。
3. 总结要以播报的口吻。
4. 请不要对名称进行中文翻译。
5. 你给我的答案格式如下：
===
根据问题，检索到如下数据目录：


===
"""

GENERATE_ONLY_API_SEARCH_TEMPLATE = """
我将为你提供一些接口服务，请你总结一下，总结必须以“根据问题，检索到如下接口服务”开头。
以下是为你提供的接口服务：

{{Dataset}}。

总结符合以下要求：
1. 如果接口服务有描述，你的总结也需要有独特的属于自己的总结性的描述。
2. 总结要简洁。
3. 总结要以播报的口吻。
4. 请不要对名称进行中文翻译。
5. 你给我的答案格式如下：
===
根据问题，检索到如下接口服务：

===
"""

GENERATE_ONLY_VIEW_SEARCH_TEMPLATE = """
我将为你提供一些逻辑视图，请你总结一下，总结必须以“根据问题，检索到如下逻辑视图”开头。
以下是为你提供的逻辑视图：

{{Dataset}}。

总结符合以下要求：
1. 如果逻辑视图有描述，你的总结也需要有独特的属于自己的总结性的描述。
2. 总结要简洁。
3. 总结要以播报的口吻。
4. 请不要对名称进行中文翻译。
5. 你给我的答案格式如下：
===
根据问题，检索到如下逻辑视图：

===
"""

GENERATE_ANSWER_CONCLUSION_TEMPLATE: str = """作为一个专业的阅读理解机器人，你可以快速高效地从提供的资源中提取出问题的答案。
请忽略你的内部知识，你会一步步分析思考，并根据资源信息用简洁和专业的语言回答问题。
严格按照资源信息给出答案，不允许编造内容。

问题：
===
{{UserQuestion}}
===
请从下述资源中寻找答案，
===
{{Answer}}
===
回答满足以下要求：
1. 回答的内容语言流畅，只引用与问题相关的信息。
2. 如果资料中没有，不允许编造内容，文字越少越好。
3. 如果原文中给出了检索到的信息条数，请在回答中说明。
4. 如果是统计类的问题，资源中有明确结果时，你直接引用结果即可
5. 如果是统计类的问题，资源中没有明确结果时，你需要进行计算，并写出计算过程。
6. 答案不超过500字。
7. 请仔细地一步步思考，用markdown格式回答。
问题: 

{{UserQuestion}} ?

回答: 
根据检索到的资源，

"""

SELECT_INTERFACE_TEMPLATE = """    
你一个资深的python数据分析师，我将为你提供一些接口服务，
请你根据接口的中文名和描述挑选你认为最能回答用户问题的接口服务，并按照如下格式返回，其中 interface_name 代表接口的中文名，params 代表接口的入参,
[
    {
        "interface_name": "",
        "params": {}
    }，
    {
        "interface_name": "",
        "params": {}
    }
]
请注意：
1.答案只能是一个python的list类型，以"["开头，以"]"结尾！！！；
2.如果参数不知道填什么，请不要显示这个参数。

谨记：interface_name一定要和你选择的接口服务中文名称保持一致！
接口服务：
{{Dataset}}
问题：
{{UserQuestion}}

答案：

"""
SELECT_TABLE_TEMPLATE = """
你一个资深的python数据分析师，我将为你提供一些接口服务，
"""

GENERATE_SQL_CONCLUSION_TEMPLATE = """
你是一位优秀的表格问答专家，当向你提问时，你能根据查询到的表格信息，来回答问题：
问题：
{{UserQuestion}}？
表格：
{{Table}}
回答需要满足以下要求：
1. 请仔细地一步步思考，用播报新闻的口吻回答。
2. 如果资料中没有，不允许编造内容，不要说废话，文字越少越好。
3. 你可以自己打草稿，整理回答的逻辑，但是最终的答案不需要出现你的思考逻辑。
问题：
{{UserQuestion}}？
答案：

"""
KEYWORDS_TEMPLATE = """
下面的句子是一个自然语言问题，请转化为搜索引擎友好的关键词。
===
{{input}}
===
注意:
请用中文回答，单词用空格隔开。

关键词：
"""


TIMEOUT_ERROR = """<span style="color:rgba(0,0,0,0.45)">抱歉，可能由于网络延迟或当前服务器繁忙，当前回答尚未完成。若您还需要继续获取更多信息，可重新发起搜索。</span>"""
NO_SOURCE: str = "抱歉，我没有找到此问题的答案。可能是答案不存在，也有可能是当前搜索能力有限或数据权限不足。您可以尝试更改关键词后重新发起搜索。"
BIG_FLAG: str = "同时由于数据资源较多，当前结果只显示了部分信息。"
NO_ANSWER: str = "抱歉，我尚未提炼出直接的答案，但查询到这些资源{resources}与您输入的关键词相关，可能包含您需要的信息，您可以直接查看资源进一步确认信息，或继续提问。"
QUERY_TOO_SHORT: str = "感谢您的提问。为了能够更好地帮助您，请输入更完整的问题。"
NO_ANSWER_WITH_RESOURCES: str = "抱歉，在您引用的资源{resources}中，我没有找到此问题的答案。可能是答案不存在，也有可能是当前搜索能力有限或数据权限不足。您可以直接査看资源进一步确认信息，或继续提问。"
NO_AUTH_WITH_RESOURCES: str = "抱歉，我无法对您引用的资源{resources}进行回答，可能有以下原因：：<br>1、您对资源的读取权限不足。<br>2、资源已下线。<br>3、资源已不存在。"


class Script:
    timeout = TIMEOUT_ERROR
    no_source = NO_SOURCE
    no_answer = NO_ANSWER
    too_many_answer = BIG_FLAG
    query_too_short = QUERY_TOO_SHORT
    no_auth_to_resources = NO_AUTH_WITH_RESOURCES
    no_answer_to_resources = NO_ANSWER_WITH_RESOURCES


if __name__ == '__main__':
    from app.logs.logger import logger
    script = Script()
    logger.info(script.timeout)
