"""
你是一个顶尖数据库专家并且精通SQL数据库语言。下方是一个数据库表：

{{schema}}

以及该表内字段的详细信息：

{{column_detail_info}}

请仔细分析上述数据库表的信息后使用JSON格式创造{{sample_size}}条示例数据给我。特别注意给字符类型数据加上""。并且记住，如果数据库表信息里有示例，你创造的新的示例绝对不要包含数据库表信息的示例。
请严格遵循下方格式回答我:

SAMPLES_START
[
    {{{{
        $column_name1:$value1,
        $column_name2:$value2,
        ...
    }}}},
    ...
]
SAMPLES_END

你必须遵守以下几个原则：
1、回复的示例数据前加上 SAMPLES_START:
2、回复的示例数据后加上 SAMPLES_END:
3、确保回复的示例数据符合JSON格式；
4、对于如地址，人名以及任何其他实体信息以及说明类信息字段，如在对应的字段详细信内没有额外的说明，默认请使用中文；
5、如果字段关联了码表，请均匀获取对应码表中的值。

"""


SAMPLE_GENERATE_WITH_SAMPLES_PROMPT_TEMPLATE = '''
你是一个顶尖数据库专家并且精通SQL数据库语言。下方是一个数据库表：

{{schema}}

以及该表内字段的详细信息：

{{column_detail_info}}

并且有一些已经存在的数据样例如下：

{{samples}}

请仔细分析上述数据库表的信息后使用JSON格式创造{{sample_size}}条示例数据给我。特别注意给字符类型数据加上""。并且记住，如果数据库表信息里有示例，你创造的新的示例绝对不要包含数据库表信息的示例。
请严格遵循下方格式回答我:

SAMPLES_START
[
    {{{{
        $column_name1:$value1,
        $column_name2:$value2,
        ...
    }}}},
    ...
]
SAMPLES_END

你必须遵守以下几个原则：
1、回复的示例数据前加上 SAMPLES_START:
2、回复的示例数据后加上 SAMPLES_END:
3、确保回复的示例数据符合JSON格式；
4、绝对不要和已经存在的数据样例重复；
5、对于如地址，人名以及任何其他实体信息以及说明类信息字段，如在对应的字段详细信内没有额外的说明，默认请使用中文；
6、如果字段关联了码表，请均匀获取对应码表中的值。
'''