
# 全部维度理解
COMPREHENSION_TEMPLATE = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的以下几个方面：
1业务维度,2正面支撑,3负面支撑,4服务范围或对象,5服务领域,6保护控制,7促进推动,8时间字段理解,9空间字段理解
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
的各项分析结果如下：
```json
{"业务维度":
{"555":"通过'行业门类',可以分析各类行业的企业数量的发展情况", "152":"通过'成立日期',可以分析存续注销/吊销/撤销/迁出等企业数量/历史趋势","321":"通过'登记机关',可以判断全市各区县/园区的企业登记数量分布情况","652":"通过'业务范围类型',可以判断注册企业是外资/港澳台/有限制/股份制等类型的企业分布情况"
},
"正面支撑":
["企业基本信息检索","企业当前经营状态的核查","全市企业发展情况分析"],
"负面支撑":
["企业是否参缴社保","企业是否参缴税务","企业登记地址与参保登记地址/税务登记地址/场所登记地址是否一致"]	,
"服务范围或对象":
["服务全市企业管理,供决策支撑","服务全市各级部门检索/核验企业基本信息","服务各区县/园区掌握本地区企业的数量/增长趋势,及时掌握区域重点企业经营状态","支撑企业办理服务事项时,输入统一社会信用代码或企业名称时,自动查询企业基本信息,或核验企业经营状态"],
"保护控制":
["能限制异常状态的企业参与招投标/资质申请等活动","能限制迁出企业停止享受当地福利待遇享受"],
"促进推动":
["促进各区县/行业有效管理区域企业经营,调整企业支撑政策,稳定区域发展","促进企业健康发展环境的培育/维护"],
"时间字段理解":{"318":"根据'登记日期'可反映每日/每每月等时间段的企业登记注册数量趋势情况","152":"根据'成立日期'可反映每日/每每月等时间段的企业登记注册数量趋势情况"},
"空间字段理解":{"321":"根据'登记机关'可以反映全市各区县、园区的企业登记数量分布情况"}
"服务领域":
"1.信用信息;2.主体管理;3.社会保障"}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""

# 复合表达
COMPREHENSION_RELATION_TEMPLATE=""" 
   你是一个数据理解专家,现在有几张表,表名和字段名如下:{{data_dict}}
请分析一下'{{query}}'这张表和哪些表可以组合起来，从而查询更多的信息
下面有一个例子可以作为参考,例如有表为'企业基本信息表'，[{'1553|企业异常名录表': ['公司ID', '申请执行人','发布日期']}, {'1564|行政许可': []}, {'1536|学生维度表': ['学号', '学生类型']}, 
{'1531|异常状态企业表': ['企业id', '异常状态情况代码', '异常状态情况描述']}, {'6479|企业年报信息表': ['公司ID', '纳税情况', '年收益', '年负债']}, {'425|课程维度表': ['课程代码', '课程名称', '表id']}]
```json
[{"table_id":["1553"],"explain":"联合【企业异常名录表】体现企业的异常情况"},
{"table_id":["1531","6479"],"explain":"联合【异常状态企业表】和【企业年报信息表】,体现企业是否存在异常状态等风险"}，
{"table_id":"["1564"]","explain":"联合【行政许可】等表体现企业已有经营许可资质信息"}]
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出给定表,必须合理,不可以随意捏造
    3.如果是与多张表之间的关联信息,id要包含多个表的id,并且与explain的表名相对应
"""

# 业务维度
COMPREHENSION_TEMPLATE_YWWD = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的业务维度
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下
```json
{"业务维度":
{"555":"通过'行业门类',可以分析各类行业的企业数量的发展情况", "152":"通过'成立日期',可以分析存续注销/吊销/撤销/迁出等企业数量/历史趋势","321":"通过'登记机关',可以判断全市各区县/园区的企业登记数量分布情况","652":"通过'业务范围类型',可以判断注册企业是外资/港澳台/有限制/股份制等类型的企业分布情况"
}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""

# 正面支撑
COMPREHENSION_TEMPLATE_ZMZC = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的正面支撑
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{"正面支撑":
["企业基本信息检索","企业当前经营状态的核查","全市企业发展情况分析"]}```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""

# 负面支撑
COMPREHENSION_TEMPLATE_FMZC = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的负面支撑
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{"负面支撑":
["企业是否参缴社保","企业是否参缴税务","企业登记地址与参保登记地址/税务登记地址/场所登记地址是否一致"]}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""

# 服务范围
COMPREHENSION_TEMPLATE_FWFW = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的服务范围
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{
"服务范围":
["服务全市企业管理,供决策支撑","服务全市各级部门检索/核验企业基本信息","服务各区县/园区掌握本地区企业的数量/增长趋势,及时掌握区域重点企业经营状态","支撑企业办理服务事项时,输入统一社会信用代码或企业名称时,自动查询企业基本信息,或核验企业经营状态"],
}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""

# 服务范围或对象（旧版）
COMPREHENSION_TEMPLATE_FWFW_OLD = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的服务范围或对象
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{
"服务范围或对象":
["服务全市企业管理,供决策支撑","服务全市各级部门检索/核验企业基本信息","服务各区县/园区掌握本地区企业的数量/增长趋势,及时掌握区域重点企业经营状态","支撑企业办理服务事项时,输入统一社会信用代码或企业名称时,自动查询企业基本信息,或核验企业经营状态"],
}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""

# 服务领域
COMPREHENSION_TEMPLATE_FWLY = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的服务领域
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{
"服务领域":[
            [
                {
                    "id": 1,
                    "name": "信用信息"
                },
                {
                    "id": 2,
                    "name": "行政执法"
                },
                {
                    "id": 3,
                    "name": "社会保障"
                }
            ]
        ]
}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""
# 服务领域（旧版）
COMPREHENSION_TEMPLATE_FWLY_OLD = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的服务领域
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{
"服务领域":
"1.信用信息;2.主体管理;3.社会保障"}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""
# 保护控制
COMPREHENSION_TEMPLATE_BHKZ = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表在'保护控制'方面的意义
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{"保护控制":
["能限制异常状态的企业参与招投标/资质申请等活动","能限制迁出企业停止享受当地福利待遇享受"]}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""
# 促进推动
COMPREHENSION_TEMPLATE_CJTD = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表能在'促进推动'方面的意义
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{"促进推动":
["促进各区县/行业有效管理区域企业经营,调整企业支撑政策,稳定区域发展","促进企业健康发展环境的培育/维护"]}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""

# 时间字段理解
COMPREHENSION_TEMPLATE_TIME = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的时间维度
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{
"时间字段理解":{"318":"根据'登记日期'可反映每日/每每月等时间段的企业登记注册数量趋势情况","152":"根据'成立日期'可反映每日/每每月等时间段的企业登记注册数量趋势情况"}}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""

# 空间字段理解
COMPREHENSION_TEMPLATE_LOACL = """
你是一个数据理解专家,现在某个单位的一张表,这个单位的职责是:
{{description}}
表为'{{query}}',表字段如下：{{data_dict}}
请结合单位业务职责表字段分析这张表的空间维度
下面有一个例子可以作为参考,例如有表为'企业基本信息表',其中包含的字段为[31|主体身份代码,14|统一社会信用代码,78|企业（机构）名称,54|注册号,555|行业门类,325|行业代码,152|成立日期,321|登记机关,652|业务范围类型,318|登记日期]
分析结果如下：
```json
{
"空间字段理解":{"321":"根据'登记机关'可以反映全市各区县、园区的企业登记数量分布情况"},
}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.回答的相关内容不可以超出这个处室的职责范围,必须合理,不可以随意捏造
"""
# 空间范围
COMPREHENSION_TEMPLATE_CITY = """
你是一个数据理解专家,现在某省的各个地级市州下辖的区、县，县级市如下所示:
{}
请根据以下区域名称分析,{{query}},这些区域名称总体上属于哪个区域
下面有几个例子可以作为参考
例1：如果所给出的区域名称包括某个地级市、州（比如某市）下辖的全部区、县、县级市， 则回答：
```json
{
"空间范围":"包含全市各区县数据"
}
```
例2：如果所给出的区域名称包括某个地级市、州（比如某市）下辖的部分区、县、县级市， 则回答：
```json
{
"空间范围":"包含市部分区县数据"
}
```
例3：如果所给出的区域名称包括全部地级市、州， 则回答：
```json
{
"空间范围":"包含全部省内数据"
}
```
例4：如果所给出的区域名称包括部分地级市、州， 则回答：
```json
{
"空间范围":"包含部分省内数据"
}
```
例5：如果所给出的区域名称包括某个地级市、州（比如某市）下辖的全部区、县、县级市， 并且包括部分地级市、州， 则回答：
```json
{
"空间范围":"包含全某市各区县和部分省内数据"
}
```
回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
    2.只需按照格式返回具体的一句话,不要返回无用信息
"""

