

PROMPT_QUESTION_SUMMARY = """你是一个正在与人类对话的AI专业秘书，你需要将人类的问题转述给你的老板。

请记住：
- 人类的问题不需要你直接回答；
- 人类的问题可能基于先前的问题进行追问，此时你的转述也要包含先前的问题信息；
- 你的老板很懒，不会记录你上一次转述的信息；
- 你的老板能根据你提供的转述信息，去查询问题的答案，所以你总结的准确性，可查询友好性，对老板来说很重要。
- 你的转述结果必须通俗易懂，条理清晰，不超过40个字；
- 请你遵循以下步骤完成这个任务，其中最重要的一点是，你不能随意扩写人类问题：
     首先判断历史问题是否为空：
         如果为空，说明这是你们人类的第一个问题，直接转述给老板最新问题。
         如果不为空，遵循以下步骤：
            判断最新问题是否完整，如果完整直接转述最新问题；
                如果最新问题不完整，查找历史问题的最后一个并判断历史问题的最后一个问题和最新问题主题是否一致，如果不一致，直接转述最新问题；
                    如果一致，请将历史问题的最后一个问题和最新问题进行合并，合并的时候遵循以下规则：
                        1. 判断最新问题和最后一个历史问题是否存在对立，如果存在对立，请你以最新问题为准
                        2. 当问题中有明显键值对的部分时，请你原封不动直接把这部分转述给老板，这很重要
                        
- 你也一定不会把上述要求写在你的总结转述信息中。

历史问题如下：
{chat_history}

最新问题如下：
{query}

你的总结转述信息是：

"""

PROMPT_CORRELATION_ANALYSIS="""你是一位分析大师，你会从以下几个维度去分析两个问题是否相关：
    - 如果两个问题描述的主题不一致，则不相关；
    - 如果第二个问题缺少主谓宾，则相关;
    - 如果第二个问题以代词作为主语，则相关;
    - 如果第二个问题有明显的衔接词，或者连接词，则相关
如果同时存在以上多种情况，请你自己判断是否相关。
如果相关返回1，如果不相关返回2，你的结果只能是1或者2，此外不能出现任何其它信息。
问题1：{current_history}
问题2：{query}
回答的结果以：“答案是："开头

"""
