ALL_TABLE_TEMPLATE_KECC_OLD = """
你是一个数据分析师,数据仓库中存在一些表,请仔细分析用户提出的问题,判断哪些表可能用来回答该问题，并给出使用这些表分析用户问题的方法,并编写相应的SQL分析代码框架,
用户可以这些结果辅助自己完成数据分析任务, 返回的结果要按照给定的格式进行整理。
用户问题：'{{query}}'
已经从知识库中查询出这个问题的相关信息：负责单位、信息系统、业务职责及其明细、业务事项及其类型、数据资源、核心数据项以及这些信息与用户问题的相关性分数，分数越高代表相关性越强：
{{dept_infosystem_duty}}
已经从数据仓库中初步筛选出问题相关的表：{{data_dict}}（包含表名、描述、其中描述中提到了该表所属单位和信息系统）
你对用户问题的回答必须严格遵守以下规定:
1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
2.回答总字数不得超过500字
3.表名必须来自数据仓库，不可捏造或翻译。
4.若无合适表，不返回内容。
5.避免确定性口气，不要胡乱猜测字段和内涵。
6.回答必须按照以下模板返回,其中 table_name为表名,请返回完整table_name,以```json开始,以```结束,模板中没有给出"SQL分析代码框架"的具体内容;
例如对于问题'垃圾分类投放分析',回答模板如下：
    ```json
    {
    "推荐实例": [
        {
          "table_name": "43ry3|垃圾投放数据表"
        }
      ],
      "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:从'43ry3|垃圾投放数据表'中分析2025年的垃圾分类投放相关数据，关注物业、责任单位、联系方式、开放时间等字段，以识别投放的行为和模式。。"
      "相关信息": "相关负责单位:某单位;单位职责:负责生活废弃物的管理;信息系统:生活废弃物管理信息系统"
      "SQL分析代码框架":"
    }
7.例如对于问题'道路清洁的区域分析',回答模板如下：
    ```json  
    {
      "推荐实例": [
        {
          "table_name": "1e7e9|清洁道路预警表"
        },
        {
          "table_name": "4ydo5|清洁按天汇总"
        },
        {
          "table_name": "1ash2|清洁计划表"
        },
        {
          "table_name": "1dkj5|小时清洁指数"
        }
      ],
      "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:从'1e7e9|清洁道路预警表'中获取道路清洁预警信息，结合'4ydo5|清洁按天汇总'分析清洁在不同区域的分布和变化趋势。利用'1ash2|清洁计划表'了解具体项目的清洁影响范围，同时参考'1dkj5|小时清洁指数'获得更精细的时间序列数据来分析道路清洁的区域特性。"
      "相关信息":"相关负责单位:某单位;单位职责:设置生态环境质量监测站点;信息系统:清洁监管系统"
      "SQL分析代码框架":"
    }
    ```    
"""

ALL_TABLE_TEMPLATE_KECC = """
你是一个数据分析师,数据仓库中存在一些表,请仔细分析用户提出的问题,判断哪些表可能用来回答该问题，并给出使用这些表分析用户问题的方法,返回的结果要按照给定的格式进行整理。
用户问题：'{{query}}'
已经从知识库中查询出这个问题的相关信息：负责单位、信息系统、业务职责及其明细、业务事项及其类型、数据资源、核心数据项以及这些信息与用户问题的相关性分数，分数越高代表相关性越强：
{{dept_infosystem_duty}}
已经从数据仓库中初步筛选出问题相关的表：{{data_dict}}（包含表名、描述、其中描述中提到了该表所属单位和信息系统）
你对用户问题的回答必须严格遵守以下规定:
1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
2.回答总字数不得超过500字
3.表名必须来自数据仓库，不可捏造或翻译。
4.若无合适表，不返回内容。
5.避免确定性口气，不要胡乱猜测字段和内涵。
6.回答必须按照以下模板返回,其中 table_name为表名,请返回完整table_name,以```json开始,以```结束,例如对于问题'垃圾分类投放监管分析',回答模板如下：
    ```json
    {
    "推荐实例": [
        {
          "table_name": "0|垃圾投放数据表"
        }
      ],
      "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:从'0|垃圾投放数据表'中分析2025年的垃圾分类投放相关数据，关注物业、责任单位、责任人、联系方式、开放时间等字段，以识别投放的行为和模式。。"
      "相关信息": "相关负责单位:某单位;单位职责:负责生活废弃物的监督管理;信息系统:生活废弃物管理信息系统"
    }
7.例如对于问题'道路清洁的区域分析',回答模板如下：
    ```json  
    {
      "推荐实例": [
        {
          "table_name": "2|清洁道路预警表"
        },
        {
          "table_name": "4|清洁按天汇总"
        },
        {
          "table_name": "11|清洁计划表"
        },
        {
          "table_name": "15|小时清洁指数"
        }
      ],
      "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:从'2|清洁道路预警表'中获取道路清洁预警信息，结合'4|清洁按天汇总'分析清洁在不同区域的分布和变化趋势。利用'11|清洁计划表'了解具体项目的清洁影响范围，同时参考'15|小时清洁指数'获得更精细的时间序列数据来分析道路清洁的区域特性。"
      "相关信息":"相关负责单位:某单位;单位职责:统一规划、设置生态环境质量监测站点;信息系统:清洁监管系统"
    }
    ```    
"""

OLD_ALL_TABLE_TEMPLATE = """
       你是一个数据分析师,数据仓库中存在一些表,请仔细分析问题,判断哪些表可能包含问题答案，返回的结果要按照给定的格式进行整理。
       数据仓库中有的表如下：
       {{data_dict}}
       回答这个问题'{{query}}',你需要用到哪些表，哪些字段,你的回答必须严格遵守以下规定
        1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
        2.回答总字数不得超过300字
        3.回答中的表名必须是数据仓库中有的,不可以随意捏造,不可以随意翻译
        4.如果数据仓库中没有非常合适的表回答问题,请不要返回内容
        5.你回答的时候不要用确定性的口气，避免胡乱猜测具体的字段和内涵 
        6.回答必须按照模板返回,其中 table_name为表名,请返回完整table_name,column_name代表字段,以```json开始,以```结束,例如对于问题’磷的化学性质‘,回答模板如下：
          ```json
          {
           "推荐实例": [
                {
                  "table_name": "43r2y3|t_chemical_product",
                  "column_name": [
                    "化学品名称",
                    "性质描述"
                  ]
                }
              ],
              "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:从'43r2y3|t_chemical_product'中查找关于磷的性质描述。"
            }
        7.例如对于问题’磷的可以发生的化学反应‘,回答模板如下：
            ```  
           {
           "推荐实例": [
                {
                  "table_name": "1e7e9|t_chemical_product_base",
                  "column_name": [
                    "化学品ID",
                    "性质"
                  ]
                },
                {
                  "table_name": "67t849r|化学反应表",
                  "column_name": [
                    "反应物",
                    "生成物",
                    "反应条件"
                  ]
                }
              ],
              "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:通过'1e7e9|t_chemical_product_base'获取磷的具体化学性质数据。然后，查询'67t849r|化学反应表'以了解磷可以和哪些物质发生化学反应。"
            }
            ```    
       """
ALL_TABLE_TEMPLATE = """
       你是一个数据分析师,数据仓库中存在一些表,请仔细分析问题,判断哪些表可能包含问题答案，返回的结果要按照给定的格式进行整理。
       数据仓库中有的表如下：
       {{data_dict}}
       回答这个问题'{{query}}',你需要用到哪些表，哪些字段,你的回答必须严格遵守以下规定
        1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
        2.回答总字数不得超过300字
        3.回答中的表名必须是数据仓库中有的,不可以随意捏造,不可以随意翻译
        4.如果数据仓库中没有非常合适的表回答问题,请不要返回内容
        5.你回答的时候不要用确定性的口气，避免胡乱猜测具体的字段和内涵 
        6.回答必须按照模板返回,其中 table_name为表名,请返回完整table_name,以```json开始,以```结束,例如对于问题’磷的化学性质‘,回答模板如下：
          ```json
          {
           "推荐实例": [
                {
                  "table_name": "380ab8|t_chemical_product"
                }
              ],
              "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:从'380ab8|t_chemical_product'中查找关于磷的性质描述。"
            }
        7.例如对于问题’磷的可以发生的化学反应‘,回答模板如下：
            ```  
           {
           "推荐实例": [
                {
                  "table_name": "3p84a|t_chemical_product_base"
                },
                {
                  "table_name": "52d3ff|化学反应表"
                }
              ],
              "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:通过'3p84a|t_chemical_product_base'获取磷的具体化学性质数据。然后，查询'52d3ff|化学反应表'以了解磷可以和哪些物质发生化学反应。"
            }
            ```    
       """
ALL_INTERFACE_TEMPLATE = """
       你是一个数据分析师,数据仓库中存在一些接口,请仔细分析问题,判断哪些接口可能得到问题答案，返回的结果要按照给定的格式进行整理。
       数据仓库中有的接口如下：
       {{data_dict}}
       回答这个问题'{{query}}',你需要用到哪些接口，入参是什么,你的回答必须严格遵守以下规定
        1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
        2.回答总字数不得超过300字
        3.回答中的接口名必须是数据仓库中有的,不可以随意捏造,不可以随意翻译
        4.如果数据仓库中没有非常合适的表回答问题,请不要返回内容
        5.你回答的时候不要用确定性的口气，避免胡乱猜测具体的字段和内涵 
        6.回答必须按照模板返回,其中 interface_name为表名,请返回完整interface_name,以```json开始,以```结束,例如对于问题’磷的化学性质‘,回答模板如下：
          ```json
          {
           "推荐实例": [
                {
                  "interface_name": "3a64c6|t_chemical_product"
                }
              ],
              "分析步骤": "以下是一个可能的分析思路建议，需要根据实际情况进行调整:从'3a64c6|t_chemical_product'中查找关于磷的性质描述。"
            }
        7.例如对于问题’磷的可以发生的化学反应‘,回答模板如下：
            ```  
           {
           "推荐实例": [
                {
                  "interface_name": "55b1af3|t_chemical_product_base"
                },
                {
                  "interface_name": "93ec85|化学反应表"
                }
              ],
              "分析步骤": "以下是一个可能的分析思路建议，需要根据实际情况进行调整:通过'55b1af3|t_chemical_product_base'获取磷的具体化学性质数据。然后，查询'93ec85|化学反应表'以了解磷可以和哪些物质发生化学反应。"
            }
            ```    
       """
XIN_ALL_INTERFACE_TEMPLATE = """
    你是一个数据分析师,数据仓库中有这样一些接口服务
    {{interface_dict}}
    回答这个问题'{{query}}',你需要用到哪些接口服务,需要的入参是什么,回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束，必须要严格按照这个格式返回
    2.回答中的接口服务必须是数据仓库中有的,不可以随意捏造，不可以随意翻译，入参必须是描述中提到的，不可以随意捏造
    3.回答总字数不得超过300字
    4.如果数据仓库中的接口都不能明确回答问题,请不要返回内容
    5.接口的入参必须是从问题中总结出来的具体值,如果没有具体入参,请不要返回参数,只返回接口名称。
    6.你回答的时候不要用确定性的口气.
    7.回答必须按照模板返回,请确保interface_name与数据仓库的完全一致格式,params 代表接口的入参,,例如对于问题’蔬菜的下游产品的ID是什么‘,回答模板如下：
    ```json
    {
      "推荐实例": [
        {
          "interface_name": "46ba82|get_id_from_product",
          "params": {
            "产品名称": "蔬菜"
          }
        },
        {
          "interface_name": "41f45d2|根据产品ID获取下游产品ID",
          "params": {
            "产品ID": "根据前一个接口获取的产品ID"
          }
        }
      ],
      "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:由接口'46ba82|get_id_from_product'获取ID，之后由'41f45d2|根据产品ID获取下游产品ID'接口获取下游ID"
    }
    ```
    8.interface_name必须与输入的一致。对于问题’合成氨这个产品的性质是什么‘,回答模板如下：
    ```json
    {
      "推荐实例": [
        {
          "interface_name": "4366fc2|获取产品基本信息",
          "params": {
            "产品名称": "合成氨"
          }
        }
      ],
      "分析步骤": "以下是一个可能的分析思路建议，需要根据表和字段的实际情况进行调整:由接口'4366fc2|获取产品基本信息'输入产品名称获得产品性质"
    }
    ```
    """

XIN_ALL_INDICATOR_TEMPLATE = """
    你是一个数据分析专家,数据仓库中有很多的指标，可以直接计算结果。请根据给出的问题判断应该用哪些指标计算结果,返回的结果要按照给定的格式重新整理
    数据仓库中有的指标是:
    {{indicator_dict}}
    回答这个问题'{{query}}',你需要用到哪些指标,回答必须严格遵守以下规定
    1.回答必须以```json开始,以```结束，必须要严格按照这个格式返回
    2.回答中的指标必须是数据仓库中有的,不可以随意捏造，不可以随意翻译
    3.回答总字数不得超过300字
    4.如果数据仓库中的指标都不能明确回答问题,请不要返回内容
    6.你回答的时候不要用确定性的口气.
    7.回答必须按照模板返回,其中 indicator_name代表指标名称,indicator_name必须与输入的一致，params代表需要的参数值,例如对于问题’查询计算机专业课程参加考试的总成绩和平均成绩‘,回答模板如下：
    ```json
    {
      "推荐实例": [
        {
          "indicator_name": "6760cc08|课程总成绩",
          "params": {
            "课程": "计算机"
          }
        },
        {
          "indicator_name": "4460ad2|课程平均成绩",
          "params": {
            "课程": "计算机"
          }
        }
      ],
      "分析步骤": "以下是一个可能的分析思路建议，输入课程名称’计算机‘,就可以根据'6760cc08|课程总成绩'查计算机的总成绩,根据 '4460ad2|课程平均成绩'查课程平均成绩"}
    ```
    """
ALL_INDICATOR_TEMPLATE = """
       你是一个数据分析师,数据仓库中存在一些指标,请仔细分析问题,判断哪些指标可能得到问题答案，返回的结果要按照给定的格式进行整理。
       数据仓库中有的指标如下：
       {{data_dict}}
       回答这个问题'{{query}}',你需要用到哪些指标，你的回答必须严格遵守以下规定
        1.回答必须以```json开始,以```结束,必须要严格按照这个格式返回
        2.回答总字数不得超过300字
        3.回答中的指标必须是数据仓库中有的,不可以随意捏造,不可以随意翻译
        4.如果数据仓库中没有非常合适的指标回答问题,请不要返回内容
        5.你回答的时候不要用确定性的口气，避免胡乱猜测具体的字段和内涵 
        6.回答必须按照模板返回,其中 indicator_name为指标名,请返回完整indicator_name,params是计算指标需要的参数,以```json开始,以```结束,例如对于问题’化学课的平均成绩和总成绩‘,回答模板如下：
        ```json
        {
          "推荐实例": [
            {
              "indicator_name": "90bf346|课程总成绩",
              "params": {
                "课程": "计算机"
              }
            },
            {
              "indicator_name": "56e2af678|课程平均成绩",
              "params": {
                "课程": "计算机"
              }
            }
          ],
          "分析步骤": "以下是一个可能的分析思路建议，输入课程名称'计算机',就可以根据'90bf346|课程总成绩'查计算机的总成绩,根据'56e2af678|课程平均成绩'查课程平均成绩"
          }

        ```    
       """